[{"title":"Python","body":"**Python** is a high-level, general-purpose programming language. Its design philosophy emphasizes code readability with the use of significant indentation."},{"title":"Javascript","body":"**JavaScript**, often abbreviated as JS, is a programming language that is one of the core technologies of the World Wide Web, alongside HTML and CSS. As of 2022, 98% of websites use JavaScript on the client side for webpage behavior, often incorporating third-party libraries. All major web browsers have a dedicated JavaScript engine to execute the code on users' devices."},{"title":"Ruby","body":"**Ruby** is an interpreted, high-level, general-purpose programming language which supports multiple programming paradigms. It was designed with an emphasis on programming productivity and simplicity. In Ruby, everything is an object, including primitive data types. It was developed in the mid-1990s by Yukihiro \"Matz\" Matsumoto in Japan. "},{"title":"CS50","body":"CS50 (Computer Science 50) is an on-campus and online introductory course on computer science taught at Harvard University and Yale University. In 2016, CS50 became available to high school students as an Advanced Placement Computer Science course. The on-campus version is Harvard's largest class with 800 students, 102 staff and up to 2,200 participants in their regular hackathons."},{"title":"HTML","body":"The HyperText Markup Language or HTML is the standard markup language for documents designed to be displayed in a web browser. It is often assisted by technologies such as Cascading Style Sheets (CSS) and scripting languages such as JavaScript. "},{"title":"Github","body":"GitHub, Inc. is an Internet hosting service for software development and version control using Git. It provides the distributed version control of Git plus access control, bug tracking, software feature requests, task management, continuous integration, and wikis for every project. Headquartered in California, it has been a subsidiary of Microsoft since 2018."},{"title":"Why_I_like_Cappy","body":"because sometimes he is nice to me"},{"title":"mm2","body":"pages[i].title.toLowerCase();\r\n\r\nthis was made by harrison btw\r\n\r\nthis page is dumb"},{"title":"Java","body":"Java is a high-level, class-based, object-oriented programming language that is designed to have as few implementation dependencies as possible. It is a general-purpose programming language intended to let programmers write once, run anywhere (WORA), meaning that compiled Java code can run on all platforms that support Java without the need to recompile. Java applications are typically compiled to bytecode that can run on any Java virtual machine (JVM) regardless of the underlying computer architecture. The syntax of Java is similar to C and C++, but has fewer low-level facilities than either of them. The Java runtime provides dynamic capabilities (such as reflection and runtime code modification) that are typically not available in traditional compiled languages. As of 2019, Java was one of the most popular programming languages in use according to GitHub, particularly for client-server web applications, with a reported 9 million developers."},{"title":"Proof_School","body":"Proof School is a secondary school in San Francisco that offers a mathematics-focused liberal arts education. Currently, 118 students in grades 6-12 are enrolled in Proof School for the academic year (2022-2023).\r\n\r\nThe school was co-founded by Dennis Leary, Ian Brown, and Paul Zeitz, the chair of mathematics at University of San Francisco. The school opened in the fall of 2015 with 45 students in grades 6-10. The curriculum is inspired by math circles, which emphasizes communication and working together to solve math problems. "},{"title":"Rust","body":"Rust is a multi-paradigm, high-level, general-purpose programming language. Rust emphasizes performance, type safety, and concurrency. Rust enforces memory safety--that is, that all references point to valid memory--without requiring the use of a garbage collector or reference counting present in other memory-safe languages. To simultaneously enforce memory safety and prevent concurrent data races, Rust's \"borrow checker\" tracks the object lifetime of all references in a program during compilation. Rust is popular for systems programming but also offers high-level features including some functional programming constructs."}]